Расширение_ЛаРС_Доработки_Бух/Documents/ЛаРС_РеестрОплатыИсков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛаРС_РеестрОплатыИсков</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>450</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежноеПоручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодЗадолженности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>21</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширение_ЛаРС_Доработки_Бух/AccumulationRegisters/ЛаРС_ОплатаИсков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛаРС_ОплатаИсков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Иск</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛаРС_Иски</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Расширение_ЛаРС_Доработки_Бух/Documents/ЛаРС_РеестрОплатыИсков/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыборПериода(Команда)
	
	Диалог 					= Новый ДиалогРедактированияСтандартногоПериода();                                 
	Диалог.Период 				= Новый СтандартныйПериод(Объект.ПериодС, Объект.ПериодПо);        
	ОписаниеОповещенияОЗакрытииФормы 	= Новый ОписаниеОповещения("ВыполнитьПослеВыбораПериода", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещенияОЗакрытииФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораПериода(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.ПериодС 	= Результат.ДатаНачала;
       	Объект.ПериодПо 	= Результат.ДатаОкончания;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.Иск КАК ЛаРС_Иск,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.ПлатежноеПоручение КАК ПлатежноеПоручение,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.СуммаРасход КАК СуммаПлатежа,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.ПениРасход КАК СуммаПени,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.Иск.Ответчик КАК ФИО,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.Иск.ПериодЗадолженности КАК ПериодЗадолженности,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.Иск.АдресСтрокой КАК Адрес
	               |ИЗ
	               |	РегистрНакопления.ЛаРС_ОплатаИсков.ОстаткиИОбороты(&ПериодС, &ПериодПо, , , ) КАК ЛаРС_ОплатаИсковОстаткиИОбороты";
	Запрос.УстановитьПараметр("ПериодС", НачалоДня(Объект.ПериодС));
	Запрос.УстановитьПараметр("ПериодПо", КонецДня(Объект.ПериодПо)); 
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.ТаблицаОплат.Загрузить(Результат);
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПечатьРеестраНаСервере()

	

КонецПроцедуры


&НаКлиенте
Процедура ПечатьРеестра(Команда)
	ПечатьРеестраНаСервере();
КонецПроцедуры
